using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Study_Branch
{
    internal class KARTRIDER_RUSH_PLUS
    {
        /* Ver 1.0
           장르 : 캐주얼 레이싱 게임 
           엔진 : 유니티
           플랫폼 : 안드로이드, iOS 
           
           Ver 2.0
           게임 모드 
           : 클래식모드
           1.스피드전
           2.아이템전
           : 아케이드 모드
           : 랭킹전
           : 시나리오 모드
           : 타임어택
           : 훈련장
           : 라이센스 테스트
           : 커스텀
           : 트랙 커스텀

           Ver 3.0
           스피드전 플레이 방법
           1. 드리프트 턴
                -1. 방향키 + DRIFT를 살짝 눌러 드리프트하세요.
                -2. 반대 방향키를 살짝 눌러 차체 방향을 바로 잡으세요
           
            2. 커팅 드리프트
                -1. 방향키 + DRIFT로 드리프트 진입
                -2. 반대 방향으로 드리프트
                -3. 차체 방향을 바로 잡으세요.
 
            3. 끌기
                -1. 부스터 사용[20]
                -2. 방향키 + DRIFT를 살짝 눌러 드리프트 하세요.
                -3. 손을 떼어 관성으로 드리프트 하세요.
                -4. 계속 부스터를 충전하세요.
            4. 역방향 게이지
                -1. 부스터 사용
                -2. 30~50도 방향으로 [드리프트] 사용
                -3. 반대 방향으로 [드리프트] 사용
                -4. 추가 부스터가 충전됩니다.
            5. 연속 끌기
                -1. 부스터 사용
                -2. 방향키 + DRIFT로 [끌기] 사용
                -3. 계속 방향키를 살짝 눌러 연속 드리프트 하세요.
                -4. 끌기 시간이 연장됩니다.
            
            아이템전 플레이 방법
            아이템전에서는 부스터 게이지가 없음
            아이템을 사용해서 상대팀과 플레이함 */


    }
}
